/* Protocol Type Long Names. */

/* The key is the four-character code, the value is the long name of the protocol. */

"ftp " = "File Transfer Protocol";
"ftpa" = "Client-side FTP (File Transfer Protocol) account";
"http" = "Hyper-Text Transfer Protocol";
"irc " = "Internet Relay Chat";
"nntp" = "Network News Transport Protocol";
"pop3" = "Post Office Protocol v3";
"smtp" = "Simple Mail Transport Protocol";
"sox " = "SOCKetS";
"imap" = "Internet Message Access Protocol";
"ldap" = "Lightweight Directory Access Protocol";
"atlk" = "AFP (Apple File Protocol) over AppleTalk";
"afp " = "AFP (Apple File Protocol) over TCP (Transmission Control Protocol)";
"teln" = "Telnet";
"ssh " = "Secure Shell";
"ftps" = "FTP (File Transfer Protocol) over TLS/SSL (Transport Layer Security / Secure Socket Library)";
"htps" = "HTTP (Hyper-Text Transfer Protocol) over TLS/SSL (Transport Layer Security / Secure Socket Library)";
"htpx" = "HTTP (Hyper-Text Transfer Protocol) proxy";
"htsx" = "HTTPS (Hyper-Text Transfer Protocol) over TLS/SSL (Transport Layer Security / Secure Socket Library) proxy";
"ftpx" = "FTP (File Transfer Protocol) proxy";
"smb " = "Windows File Sharing";
"rtsp" = "Real-Time Streaming Protocol";
"rtsx" = "RTSP (Real-Time Streaming Protocol) proxy";
"daap" = "Digital Audio Access Protocol";
"eppc" = "Remote Apple Events";
"ipp " = "Internet Printing Protocol";
"ntps" = "NNTP (Network News Transport Protocol) over TLS/SSL (Transport Layer Security / Secure Socket Library)";
"ldps" = "LDAP (Lightweight Directory Access Protocol) over TLS/SSL (Transport Layer Security / Secure Socket Library)";
"tels" = "Telnet over TLS/SSL (Transport Layer Security / Secure Socket Library)";
"imps" = "IMAP4 (Internet Message Access Protocol v4) over TLS/SSL (Transport Layer Security / Secure Socket Library)";
"ircs" = "IRC (Internet Relay Chat) over TLS/SSL (Transport Layer Security / Secure Socket Library)";
"pops" = "POP3 (Post Office Protocol v3) over TLS/SSL (Transport Layer Security / Secure Socket Library)";


/* 3rd party codes. */

"AdIM" = "Adium";